Revit 2027 API
FabricSheet.GetWireCenterlines Method
 Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Curve> GetWireCenterlines()
Public Function GetWireCenterlines As IList(Of Curve)
public:
IList<Curve^>^ GetWireCenterlines()
member GetWireCenterlines : unit -> IList<Curve>
Return Value
IList<Curve>
 The centerline curves.
See Also
Reference
FabricSheet Class
GetWireCenterlines Overload
Autodesk.Revit.DB.Structure Namespace